Results/ReplicaCountAndLatency/ldbc/Neo4j/4.txt
/usr/bin/java  -classpath /home/ayush/work/GRACEBenchmarks/YCSB/conf:/home/ayush/work/GRACEBenchmarks/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/grace-binding-0.18.0-SNAPSHOT.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/HdrHistogram-2.1.12.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/antlr4-runtime-4.9.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/arangodb-java-driver-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/bson-5.5.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/bson-record-codec-5.5.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/caffeine-2.3.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-beanutils-1.9.4.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-collections-3.2.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-configuration2-2.8.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-lang3-3.12.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-logging-1.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-text-1.10.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/core-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/error_prone_annotations-2.11.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/exp4j-0.4.8.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/failureaccess-1.0.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-core-3.6.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-driver-3.7.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-groovy-3.6.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-language-3.6.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-shaded-3.6.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-util-3.7.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-2.5.15-indy.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-cli-picocli-2.5.15.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-console-2.5.15.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-groovysh-2.5.15-indy.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-json-2.5.15-indy.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-jsr223-2.5.15-indy.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-swing-2.5.15.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-templates-2.5.15.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-xml-2.5.15.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/guava-31.1-jre.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/hppc-0.7.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/http-protocol-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/ivy-2.5.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/j2objc-annotations-1.3.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jackson-annotations-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jackson-core-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jackson-databind-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jackson-datatype-jakarta-jsonp-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jackson-serde-json-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jakarta.json-api-2.1.3.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/janusgraph-driver-1.0.0-rc2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/javatuples-1.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jbcrypt-0.4.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jcabi-log-0.20.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jcabi-manifests-1.2.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jcl-over-slf4j-1.7.25.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jline-2.14.6.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jsr305-3.0.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jts-core-1.17.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/mongodb-driver-core-5.5.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/mongodb-driver-sync-5.5.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/neo4j-java-driver-4.4.3.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-all-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-buffer-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-dns-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-haproxy-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-http-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-http2-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-memcache-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-mqtt-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-redis-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-smtp-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-socks-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-stomp-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-xml-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-common-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-handler-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-handler-proxy-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-handler-ssl-ocsp-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-resolver-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-resolver-dns-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-resolver-dns-classes-macos-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-aarch_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-x86_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-classes-epoll-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-classes-kqueue-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-aarch_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-x86_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-aarch_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-x86_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-native-unix-common-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-rxtx-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-sctp-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-udt-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/noggit-0.8.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/picocli-4.3.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/reactive-streams-1.0.3.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/slf4j-api-1.7.25.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/snakeyaml-1.32.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/spatial4j-0.8.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/vertx-auth-common-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/vertx-core-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/vertx-uri-template-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/vertx-web-client-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/vertx-web-common-4.5.7.jar site.ycsb.Client -t -db site.ycsb.db.GraceClient -P workloads/workload_grace -p HOSTURI=http://localhost:3000 -p DBTYPE=neo4j -p DBURI=bolt://localhost:7687 -p maxexecutiontime=360 -p threadcount=1 -p loadVertexFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_load_vertices.json -p loadEdgeFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_load_edges.json -p vertexAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_update_vertices.json -p edgeAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_update_edges.json
Loaded 147023 vertices and 387329 edges
Initializing db: site.ycsb.db.GraceClient
GraceClient  Created
Using Database: site.ycsb.DBWrapper
Starting GRACE client
{deleteproportion=1, loadEdgeFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_load_edges.json, recordcount=10000, operationcount=20000000, loadVertexFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_load_vertices.json, edgeAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_update_edges.json, readproportion=1, workload=site.ycsb.workloads.CoreWorkload, threadcount=1, updateproportion=1, DBTYPE=neo4j, dotransactions=true, HOSTURI=http://localhost:3000, createproportion=1, DBURI=bolt://localhost:7687, maxexecutiontime=360, vertexAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_update_vertices.json, readallfields=true, db=site.ycsb.db.GraceClient, requestdistribution=latest}
GRACE HOSTURI: http://localhost:3000
DBTYPE: neo4j
DBURI: bolt://localhost:7687
[OVERALL], RunTime(ms), 361169
[OVERALL], Throughput(ops/sec), 1.0715205347081282
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 223
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.06174394812400842
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 223
[TOTAL_GC_TIME_%], Time(%), 0.06174394812400842
[REMOVE_VERTEX], Operations, 19
[REMOVE_VERTEX], AverageLatency(us), 1273074.5263157894
[REMOVE_VERTEX], MinLatency(us), 1178624
[REMOVE_VERTEX], MaxLatency(us), 1404927
[REMOVE_VERTEX], 50thPercentileLatency(us), 1279999
[REMOVE_VERTEX], 95thPercentileLatency(us), 1404927
[REMOVE_VERTEX], 99thPercentileLatency(us), 1404927
[REMOVE_VERTEX], Return=OK, 19
[GET_EDGE_WITH_PROPERTY], Operations, 27
[GET_EDGE_WITH_PROPERTY], AverageLatency(us), 550584.8888888889
[GET_EDGE_WITH_PROPERTY], MinLatency(us), 431872
[GET_EDGE_WITH_PROPERTY], MaxLatency(us), 785407
[GET_EDGE_WITH_PROPERTY], 50thPercentileLatency(us), 515839
[GET_EDGE_WITH_PROPERTY], 95thPercentileLatency(us), 727039
[GET_EDGE_WITH_PROPERTY], 99thPercentileLatency(us), 785407
[GET_EDGE_WITH_PROPERTY], Return=OK, 27
[ADD_EDGE], Operations, 32
[ADD_EDGE], AverageLatency(us), 1584208.0
[ADD_EDGE], MinLatency(us), 1306624
[ADD_EDGE], MaxLatency(us), 2193407
[ADD_EDGE], 50thPercentileLatency(us), 1563647
[ADD_EDGE], 95thPercentileLatency(us), 1837055
[ADD_EDGE], 99thPercentileLatency(us), 2193407
[ADD_EDGE], Return=OK, 32
[GET_VERTEX_WITH_PROPERTY], Operations, 34
[GET_VERTEX_WITH_PROPERTY], AverageLatency(us), 117916.23529411765
[GET_VERTEX_WITH_PROPERTY], MinLatency(us), 74432
[GET_VERTEX_WITH_PROPERTY], MaxLatency(us), 259839
[GET_VERTEX_WITH_PROPERTY], 50thPercentileLatency(us), 104127
[GET_VERTEX_WITH_PROPERTY], 95thPercentileLatency(us), 179071
[GET_VERTEX_WITH_PROPERTY], 99thPercentileLatency(us), 259839
[GET_VERTEX_WITH_PROPERTY], Return=OK, 34
[ADD_VERTEX], Operations, 20
[ADD_VERTEX], AverageLatency(us), 966592.0
[ADD_VERTEX], MinLatency(us), 938496
[ADD_VERTEX], MaxLatency(us), 1090559
[ADD_VERTEX], 50thPercentileLatency(us), 955391
[ADD_VERTEX], 95thPercentileLatency(us), 1035263
[ADD_VERTEX], 99thPercentileLatency(us), 1090559
[ADD_VERTEX], Return=OK, 20
[REMOVE_EDGE_PROPERTY], Operations, 29
[REMOVE_EDGE_PROPERTY], AverageLatency(us), 2116360.827586207
[REMOVE_EDGE_PROPERTY], MinLatency(us), 1803264
[REMOVE_EDGE_PROPERTY], MaxLatency(us), 2672639
[REMOVE_EDGE_PROPERTY], 50thPercentileLatency(us), 2121727
[REMOVE_EDGE_PROPERTY], 95thPercentileLatency(us), 2478079
[REMOVE_EDGE_PROPERTY], 99thPercentileLatency(us), 2672639
[REMOVE_EDGE_PROPERTY], Return=OK, 29
[REMOVE_EDGE], Operations, 24
[REMOVE_EDGE], AverageLatency(us), 2836821.3333333335
[REMOVE_EDGE], MinLatency(us), 2473984
[REMOVE_EDGE], MaxLatency(us), 3409919
[REMOVE_EDGE], 50thPercentileLatency(us), 2887679
[REMOVE_EDGE], 95thPercentileLatency(us), 3078143
[REMOVE_EDGE], 99thPercentileLatency(us), 3409919
[REMOVE_EDGE], Return=OK, 24
[GET_EDGE_LABELS], Operations, 23
[GET_EDGE_LABELS], AverageLatency(us), 314562.7826086957
[GET_EDGE_LABELS], MinLatency(us), 231552
[GET_EDGE_LABELS], MaxLatency(us), 478207
[GET_EDGE_LABELS], 50thPercentileLatency(us), 260735
[GET_EDGE_LABELS], 95thPercentileLatency(us), 454143
[GET_EDGE_LABELS], 99thPercentileLatency(us), 478207
[GET_EDGE_LABELS], Return=OK, 23
[REMOVE_VERTEX_PROPERTY], Operations, 27
[REMOVE_VERTEX_PROPERTY], AverageLatency(us), 1227491.5555555555
[REMOVE_VERTEX_PROPERTY], MinLatency(us), 1091584
[REMOVE_VERTEX_PROPERTY], MaxLatency(us), 2092031
[REMOVE_VERTEX_PROPERTY], 50thPercentileLatency(us), 1193983
[REMOVE_VERTEX_PROPERTY], 95thPercentileLatency(us), 1342463
[REMOVE_VERTEX_PROPERTY], 99thPercentileLatency(us), 2092031
[REMOVE_VERTEX_PROPERTY], Return=OK, 27
[GET_VERTEX_COUNT], Operations, 24
[GET_VERTEX_COUNT], AverageLatency(us), 7393.083333333333
[GET_VERTEX_COUNT], MinLatency(us), 3182
[GET_VERTEX_COUNT], MaxLatency(us), 32527
[GET_VERTEX_COUNT], 50thPercentileLatency(us), 6159
[GET_VERTEX_COUNT], 95thPercentileLatency(us), 8799
[GET_VERTEX_COUNT], 99thPercentileLatency(us), 32527
[GET_VERTEX_COUNT], Return=OK, 24
[GET_EDGES_WITH_LABEL], Operations, 42
[GET_EDGES_WITH_LABEL], AverageLatency(us), 26587.47619047619
[GET_EDGES_WITH_LABEL], MinLatency(us), 6896
[GET_EDGES_WITH_LABEL], MaxLatency(us), 56223
[GET_EDGES_WITH_LABEL], 50thPercentileLatency(us), 23583
[GET_EDGES_WITH_LABEL], 95thPercentileLatency(us), 48095
[GET_EDGES_WITH_LABEL], 99thPercentileLatency(us), 56223
[GET_EDGES_WITH_LABEL], Return=OK, 42
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5.0
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 5
[CLEANUP], 50thPercentileLatency(us), 5
[CLEANUP], 95thPercentileLatency(us), 5
[CLEANUP], 99thPercentileLatency(us), 5
[SET_EDGE_PROPERTY], Operations, 22
[SET_EDGE_PROPERTY], AverageLatency(us), 2115351.272727273
[SET_EDGE_PROPERTY], MinLatency(us), 1831936
[SET_EDGE_PROPERTY], MaxLatency(us), 2500607
[SET_EDGE_PROPERTY], 50thPercentileLatency(us), 2103295
[SET_EDGE_PROPERTY], 95thPercentileLatency(us), 2369535
[SET_EDGE_PROPERTY], 99thPercentileLatency(us), 2500607
[SET_EDGE_PROPERTY], Return=OK, 22
[SET_VERTEX_PROPERTY], Operations, 23
[SET_VERTEX_PROPERTY], AverageLatency(us), 1267021.9130434783
[SET_VERTEX_PROPERTY], MinLatency(us), 1144832
[SET_VERTEX_PROPERTY], MaxLatency(us), 1393663
[SET_VERTEX_PROPERTY], 50thPercentileLatency(us), 1250303
[SET_VERTEX_PROPERTY], 95thPercentileLatency(us), 1383423
[SET_VERTEX_PROPERTY], 99thPercentileLatency(us), 1393663
[SET_VERTEX_PROPERTY], Return=OK, 23
[GET_EDGE_COUNT], Operations, 30
[GET_EDGE_COUNT], AverageLatency(us), 8681.233333333334
[GET_EDGE_COUNT], MinLatency(us), 3492
[GET_EDGE_COUNT], MaxLatency(us), 62911
[GET_EDGE_COUNT], 50thPercentileLatency(us), 5107
[GET_EDGE_COUNT], 95thPercentileLatency(us), 37087
[GET_EDGE_COUNT], 99thPercentileLatency(us), 62911
[GET_EDGE_COUNT], Return=OK, 30